content/my-emacs-config.org
#+STARTUP: overview hidestars
#+AUTHOR: Jon Rostran
#+PROPERTY: header-args:emacs-lisp :tangle ~/.emacs.d/init.el :comments no :results silent


* My personal Emacs settings
** Getting Started
A fresh Emacs installation loads with custom programs that can be accessed
with [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html][Elisp]] forms. Forms may implement complete programs of almost any type.
To illustrate, Emacs has built into it a Tetris implementation, which can be
played by [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Keys.html][typing in the keyboard]] the [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Commands.html][Meta command]] then followed by the
program's name (~M-x tetris~).

[[https://www.gnu.org/software/emacs/manual/html_node/emacs/Org-Mode.html][Org Mode]] is a productivity program implemented in Elisp and available in Emacs.
Org Mode's markup allows organizing any file into heading sections as long as the
file name extension ends with ~.org~.  Org mode can interpret and convert these
markup symbols to HTML – like other popular static site generators that, instead,
understand and convert from Markdown.

The content inside this file can be accessed through the internet on my personal [[https://rostran.dev][site]],
generated by using Org Mode's publishing system and deployed with GitHub.

Try pulling the [[https://github.com/lljr/blog/blob/main/content/Emacs.org][main file]] in the blog repo then navigate to it in Emacs.
Type ~M-x org-babel-tangle~ to override the main configuration file with these
settings. Save time by using the keychord shortcut ~C-c C-v C-t~ instead.

Emacs documents all of its variables.  When in doubt, call
~M-x describe-variable~ or ~M-x describe-function~.
Keychords may also be used: ~C-h v [variable symbol]~,
~C-h f [function symbol]~ respectively.

** Setup
*** Package manager
Get extra functionality by pointing to MELPA package directory.
#+begin_src emacs-lisp
  (require 'package)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))
#+end_src
*** Default Emacs UI
#+BEGIN_SRC emacs-lisp
  (menu-bar-mode -1)            ; Disable for more headspace
  (tool-bar-mode -1)			; Remove toolbar
  (scroll-bar-mode -1) 			; Remove scroll bar
  (save-place-mode 1)           ; Remember cursor position
  (load-theme 'modus-vivendi nil)
#+END_SRC
*** General
#+BEGIN_SRC emacs-lisp
  (setq-default inhibit-startup-message t              ; Don't show default emacs startup screen
                window-combination-resize t            ; Resize windows proportionally
                display-time-default-load-average nil  ; Don't show system load time in modeline
                indent-tabs-mode nil                   ; Stop using tabs to indent
                tab-width 4  				             ; Change default tab width

                ;; My machine has enough memory to increase the default values
                gc-cons-threshold 50000000
                large-file-warning-threshold 100000000

                ;; Increase default max recursion depth (when coding in Elisp)
                max-specpdl-size 19500
                max-lisp-eval-depth 24000

                bidi-paragraph-direction 'left-to-right ; Just work with left to right langs
                bidi-inhibit-bpa t

                ;; Directories
                delete-by-moving-to-trash t
                auto-revert-check-vc-info t

                use-short-answers t)

  ;; Toggle features not available in a fresh Emacs install
  (put 'downcase-region 'disabled nil)                 ; Allow use of C-x C-l (downcase region)
  (put 'upcase-region 'disabled nil)                   ; Allow use of C-x C-u (capitalize region)
  (put 'narrow-to-region 'disabled nil) 	             ; Allows to narrow region

  ;; Useful Register setup when appending/prepending
  (setq register-separator ?+)
  (set-register register-separator "\n\n")
  ;; (set-register ?z '(file . ""))

  ;; Useful functionality
  (add-hook 'before-save-hook 'delete-trailing-whitespace)
  (add-hook 'after-save-hook
            'executable-make-buffer-file-executable-if-script-p)

  (global-set-key (kbd "C-x k") 'kill-this-buffer)

  (global-so-long-mode 1)

  ;; Change Emacs backup files location
  (setq backup-directory-alist
        '(("." . "~/.config/emacs")))

  ;; This change prevents the crashing of the React server after any file change
  (setq create-lockfiles nil)

  ;; inherit PATH from shell, depends on `exec-path-from-shell' package
  (exec-path-from-shell-initialize)
  (setq project-vc-extra-root-markers '("tsconfig.json" "build.clj"))
  (setq project-vc-ignores '("node_modules"))
#+END_SRC

