my-emacs-config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org070441a">My personal Emacs settings</a>
<ul>
<li><a href="#orgdb44bd7">Getting Started</a></li>
<li><a href="#org3483b74">Setup</a>
<ul>
<li><a href="#org1390243">Package manager</a></li>
<li><a href="#orge726e31">Default Emacs UI</a></li>
<li><a href="#org225adcf">General</a></li>
<li><a href="#org3f3f3f8">Custom prefix keys</a></li>
<li><a href="#orged7ca04">Org</a></li>
<li><a href="#orgcb3eee0">Extras</a></li>
</ul>
</li>
<li><a href="#orgdbfa7f3">Packages</a>
<ul>
<li><a href="#org4633e57">Dired</a></li>
<li><a href="#orgea75873">Vertico / Orderless / CtrlF / Marginalia / Consult</a></li>
<li><a href="#orgff70f74">Corfu &amp; Cape</a></li>
<li><a href="#org8abf25b">Web Development</a></li>
<li><a href="#orgcff8e60">Rainbow Delimiters</a></li>
<li><a href="#org4a70314">Clojure</a></li>
<li><a href="#org53ec7ff">Dev tools</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org070441a" class="outline-2">
<h2 id="org070441a">My personal Emacs settings</h2>
<div class="outline-text-2" id="text-org070441a">
</div>
<div id="outline-container-orgdb44bd7" class="outline-3">
<h3 id="orgdb44bd7">Getting Started</h3>
<div class="outline-text-3" id="text-orgdb44bd7">
<p>
A fresh Emacs installation loads with custom programs that can be accessed
with <a href="https://www.gnu.org/software/emacs/manual/html_mono/elisp.html">Elisp</a> forms. Forms may implement complete programs of almost any type.
To illustrate, Emacs has built into it a Tetris implementation, which can be
played by <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Keys.html">typing in the keyboard</a> the <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Commands.html">Meta command</a> then followed by the
program's name (<code>M-x tetris</code>).
</p>

<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Org-Mode.html">Org Mode</a> is a productivity program implemented in Elisp and available in Emacs.
Org Mode's markup allows organizing any file into heading sections as long as the
file name extension ends with <code>.org</code>.  Org mode can interpret and convert these
markup symbols to HTML – like other popular static site generators that, instead,
understand and convert from Markdown.
</p>

<p>
The content inside this file can be accessed through the internet on my personal <a href="https://rostran.dev">site</a>,
generated by using Org Mode's publishing system and deployed with GitHub.
</p>

<p>
Try pulling the <a href="https://github.com/lljr/blog/blob/main/content/Emacs.org">main file</a> in the blog repo then navigate to it in Emacs.
Type <code>M-x org-babel-tangle</code> to override the main configuration file with these
settings. Save time by using the keychord shortcut <code>C-c C-v C-t</code> instead.
</p>

<p>
Emacs documents all of its variables.  When in doubt, call
<code>M-x describe-variable</code> or <code>M-x describe-function</code>.
Keychords may also be used: <code>C-h v [variable symbol]</code>,
<code>C-h f [function symbol]</code> respectively.
</p>
</div>
</div>

<div id="outline-container-org3483b74" class="outline-3">
<h3 id="org3483b74">Setup</h3>
<div class="outline-text-3" id="text-org3483b74">
</div>
<div id="outline-container-org1390243" class="outline-4">
<h4 id="org1390243">Package manager</h4>
<div class="outline-text-4" id="text-org1390243">
<p>
Get extra functionality by pointing to MELPA package directory.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">package</span>)
(add-to-list 'package-archives '(<span style="font-style: italic;">"melpa"</span> . <span style="font-style: italic;">"https://melpa.org/packages/"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-orge726e31" class="outline-4">
<h4 id="orge726e31">Default Emacs UI</h4>
<div class="outline-text-4" id="text-orge726e31">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(menu-bar-mode -1)            <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Disable for more headspace</span>
(tool-bar-mode -1)                      <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Remove toolbar</span>
(scroll-bar-mode -1)                    <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Remove scroll bar</span>
(save-place-mode 1)           <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Remember cursor position</span>
(load-theme 'modus-vivendi nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-org225adcf" class="outline-4">
<h4 id="org225adcf">General</h4>
<div class="outline-text-4" id="text-org225adcf">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq-default</span> inhibit-startup-message t              <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Don't show default emacs startup screen</span>
              window-combination-resize t            <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Resize windows proportionally</span>
              display-time-default-load-average nil  <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Don't show system load time in modeline</span>
              indent-tabs-mode nil                   <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Stop using tabs to indent</span>
              tab-width 4                                            <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Change default tab width</span>

              <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">My machine has enough memory to increase the default values</span>
              gc-cons-threshold 50000000
              large-file-warning-threshold 100000000

              <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Increase default max recursion depth (when coding in Elisp)</span>
              max-specpdl-size 19500
              max-lisp-eval-depth 24000

              bidi-paragraph-direction 'left-to-right <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Just work with left to right langs</span>
              bidi-inhibit-bpa t

              <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Directories</span>
              delete-by-moving-to-trash t
              auto-revert-check-vc-info t

              use-short-answers t)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Toggle features not available in a fresh Emacs install</span>
(put 'downcase-region 'disabled nil)                 <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Allow use of C-x C-l (downcase region)</span>
(put 'upcase-region 'disabled nil)                   <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Allow use of C-x C-u (capitalize region)</span>
(put 'narrow-to-region 'disabled nil)                <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Allows to narrow region</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Useful Register setup when appending/prepending</span>
(<span style="font-weight: bold;">setq</span> register-separator ?+)
(set-register register-separator <span style="font-style: italic;">"\n\n"</span>)
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(set-register ?z '(file . ""))</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Useful functionality</span>
(add-hook 'before-save-hook 'delete-trailing-whitespace)
(add-hook 'after-save-hook
          'executable-make-buffer-file-executable-if-script-p)

(global-set-key (kbd <span style="font-style: italic;">"C-x k"</span>) 'kill-this-buffer)

(global-so-long-mode 1)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Change Emacs backup files location</span>
(<span style="font-weight: bold;">setq</span> backup-directory-alist
      '((<span style="font-style: italic;">"."</span> . <span style="font-style: italic;">"~/.config/emacs"</span>)))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">This change prevents the crashing of the React server after any file change</span>
(<span style="font-weight: bold;">setq</span> create-lockfiles nil)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">inherit PATH from shell, depends on `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">exec-path-from-shell</span><span style="font-weight: bold; font-style: italic;">' package</span>
(exec-path-from-shell-initialize)
(<span style="font-weight: bold;">setq</span> project-vc-extra-root-markers '(<span style="font-style: italic;">"tsconfig.json"</span> <span style="font-style: italic;">"build.clj"</span>))
(<span style="font-weight: bold;">setq</span> project-vc-ignores '(<span style="font-style: italic;">"node_modules"</span>))
</pre>
</div>
</div>
</div>
