content/my-emacs-config.org
*** Custom prefix keys
 Some functions get called often but are not binded to a keychord by default.
 Custom prefix keys allows defining a key and bind it to a function.
#+BEGIN_SRC emacs-lisp
  ;; Keys may be binded globally like below
  (global-set-key (kbd "<C-M-return>") 'delete-other-windows)

  ;; Define C-z key map
  (define-prefix-command 'my-super-z-map)
  ;; Bind C-z to custom prefix command
  (global-set-key (kbd "C-z") 'my-super-z-map)

  ;; Set of mapped keys in `C-z'
  (define-key my-super-z-map (kbd "o") 'browse-url-at-point)
  (define-key my-super-z-map (kbd "a") 'add-file-local-variable-prop-line)
#+END_SRC

*** Org
#+begin_src emacs-lisp
    (with-eval-after-load 'org
      (visual-line-mode 1) ; wrap lines
      (setq org-src-fontify-natively t    ; highlight syntax in code source blocks
            org-catch-invisible-edits t))

    ;; Org Babel Setup
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((shell . t)
       (latex . t)
       (python . t)
       (ditaa . t)))
#+end_src
**** Org Tree Slide
Create slide-shows with Org mode.
#+begin_src emacs-lisp
  (with-eval-after-load 'org-tree-slide-mode
    (org-image-actual-width nil))
#+end_src
*** Extras
Nice to have packages and functionality.
Most of these improve coding experience.
**** Electricity
 #+begin_src emacs-lisp
   ;; Electric Layout Mode
   (add-hook 'css-mode 'electric-layout-mode)    ; insert newline after the insertion of '{'

   (electric-indent-mode +1) ; toggle on the fly re-indentation

   ;; Electric Pairs
   (add-hook 'mhtml-mode-hook 'electric-pair-local-mode)
   (add-hook 'emacs-lisp-mode-hook 'electric-pair-local-mode)
   (add-hook 'clojure-mode-hook 'electric-pair-local-mode)
   (add-hook 'lisp-interaction-mode-hook 'electric-pair-local-mode)
   (add-hook 'web-mode-hook 'electric-pair-local-mode)
   (add-hook 'ielm-mode-hook 'electric-pair-local-mode)
   (add-hook 'js-mode-hook 'electric-pair-local-mode)
   (add-hook 'typescript-mode-hook 'electric-pair-local-mode)
   (add-hook 'org-mode-hook 'electric-pair-local-mode)
   (add-hook 'scheme-mode-hook 'electric-pair-local-mode)
   (add-hook 'python-mode-hook 'electric-pair-local-mode)
   (add-hook 'css-mode-hook 'electric-pair-local-mode)

   ;; Add extra pairs for js-mode
   (defvar js-mode-electric-pairs '((?` . ?`)) "Electric pairs for js-mode.")
   (defun js-mode-add-electric-pairs ()
     (setq-local electric-pair-pairs (append electric-pair-pairs js-mode-electric-pairs))
     (setq-local electric-pair-text-pairs electric-pair-pairs))
   (add-hook 'js-mode-hook 'js-mode-add-electric-pairs)
   (add-hook 'mhtml-mode-hook 'js-mode-add-electric-pairs) ; needs it for `script` tags

   ;; Subword Mode
   (add-hook 'js-mode-hook #'subword-mode)
   (add-hook 'js-jsx-mode-hook #'subword-mode)
   (add-hook 'typescript-mode-hook #'subword-mode)
   (add-hook 'python-mode-hook #'subword-mode)
   (add-hook 'c-mode-hook #'subword-mode)
   (add-hook 'clojure-mode-hook #'subword-mode)

   ;; Enable Dash font-locking
   (eval-after-load 'dash '(dash-enable-font-lock))
 #+end_src

**** Prettify Symbols
  #+BEGIN_SRC emacs-lisp
    (global-prettify-symbols-mode t)

    (defun my-add-pretty-lambda ()
      "Make some word or string show as pretty Unicode symbols"
      (push '("lambda" . 955) prettify-symbols-alist)	      ; λ
      (push '("->" . 8594) prettify-symbols-alist)            ; →
      (push '("=>" . 8658) prettify-symbols-alist)            ; ⇒
      (push '("map" . 8614) prettify-symbols-alist) 	      ; ↦
      )

    (add-hook 'tex-mode-hook 'my-add-pretty-lambda)

    (add-hook 'emacs-lisp-mode-hook
              (lambda ()
                "Beautify Emacs Symbols"
                (push '("<=" . "≤") prettify-symbols-alist)))

    (add-hook 'scheme-mode-hook
              (lambda ()
                "Beautify Emacs Symbols"
                (push '("<=" . "≤") prettify-symbols-alist)))

    (add-hook 'clojure-mode-hook
              (lambda ()
                "Beautify Clojure Symbols"
                (push '("map" . 8614) prettify-symbols-alist)
                (push '("->" . 8594) prettify-symbols-alist)))
  #+END_SRC

** Packages
*** Dired
#+BEGIN_SRC emacs-lisp
  (setq dired-recursive-copies 'always ; “always” means no asking
        dired-recursive-deletes 'top ; “top” means ask once
        dired-dwim-target t)

  (add-hook 'dired-mode-hook '(lambda ()
                                (dired-hide-details-mode 1)))

  (put 'dired-find-alternate-file 'disabled nil)
#+END_SRC
