my-emacs-config.html

<div id="outline-container-org3f3f3f8" class="outline-4">
<h4 id="org3f3f3f8">Custom prefix keys</h4>
<div class="outline-text-4" id="text-org3f3f3f8">
<p>
Some functions get called often but are not binded to a keychord by default.
Custom prefix keys allows defining a key and bind it to a function.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Keys may be binded globally like below</span>
(global-set-key (kbd <span style="font-style: italic;">"&lt;C-M-return&gt;"</span>) 'delete-other-windows)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Define C-z key map</span>
(define-prefix-command 'my-super-z-map)
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Bind C-z to custom prefix command</span>
(global-set-key (kbd <span style="font-style: italic;">"C-z"</span>) 'my-super-z-map)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set of mapped keys in `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">C-z</span><span style="font-weight: bold; font-style: italic;">'</span>
(define-key my-super-z-map (kbd <span style="font-style: italic;">"o"</span>) 'browse-url-at-point)
(define-key my-super-z-map (kbd <span style="font-style: italic;">"a"</span>) 'add-file-local-variable-prop-line)
</pre>
</div>
</div>
</div>

<div id="outline-container-orged7ca04" class="outline-4">
<h4 id="orged7ca04">Org</h4>
<div class="outline-text-4" id="text-orged7ca04">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">with-eval-after-load</span> 'org
  (visual-line-mode 1) <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">wrap lines</span>
  (<span style="font-weight: bold;">setq</span> org-src-fontify-natively t    <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">highlight syntax in code source blocks</span>
        org-catch-invisible-edits t))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Org Babel Setup</span>
(org-babel-do-load-languages
 'org-babel-load-languages
 '((shell . t)
   (latex . t)
   (python . t)
   (ditaa . t)))
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orgddfcb66"></a>Org Tree Slide<br />
<div class="outline-text-5" id="text-orgddfcb66">
<p>
Create slide-shows with Org mode.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">with-eval-after-load</span> 'org-tree-slide-mode
  (org-image-actual-width nil))
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgcb3eee0" class="outline-4">
<h4 id="orgcb3eee0">Extras</h4>
<div class="outline-text-4" id="text-orgcb3eee0">
<p>
Nice to have packages and functionality.
Most of these improve coding experience.
</p>
</div>
<ul class="org-ul">
<li><a id="org3010fd1"></a>Electricity<br />
<div class="outline-text-5" id="text-org3010fd1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Electric Layout Mode</span>
(add-hook 'css-mode 'electric-layout-mode)    <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">insert newline after the insertion of '{'</span>

(electric-indent-mode +1) <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">toggle on the fly re-indentation</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Electric Pairs</span>
(add-hook 'mhtml-mode-hook 'electric-pair-local-mode)
(add-hook 'emacs-lisp-mode-hook 'electric-pair-local-mode)
(add-hook 'clojure-mode-hook 'electric-pair-local-mode)
(add-hook 'lisp-interaction-mode-hook 'electric-pair-local-mode)
(add-hook 'web-mode-hook 'electric-pair-local-mode)
(add-hook 'ielm-mode-hook 'electric-pair-local-mode)
(add-hook 'js-mode-hook 'electric-pair-local-mode)
(add-hook 'typescript-mode-hook 'electric-pair-local-mode)
(add-hook 'org-mode-hook 'electric-pair-local-mode)
(add-hook 'scheme-mode-hook 'electric-pair-local-mode)
(add-hook 'python-mode-hook 'electric-pair-local-mode)
(add-hook 'css-mode-hook 'electric-pair-local-mode)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Add extra pairs for js-mode</span>
(<span style="font-weight: bold;">defvar</span> <span style="font-weight: bold; font-style: italic;">js-mode-electric-pairs</span> '((?` . ?`)) <span style="font-style: italic;">"Electric pairs for js-mode."</span>)
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">js-mode-add-electric-pairs</span> ()
  (<span style="font-weight: bold;">setq-local</span> electric-pair-pairs (append electric-pair-pairs js-mode-electric-pairs))
  (<span style="font-weight: bold;">setq-local</span> electric-pair-text-pairs electric-pair-pairs))
(add-hook 'js-mode-hook 'js-mode-add-electric-pairs)
(add-hook 'mhtml-mode-hook 'js-mode-add-electric-pairs) <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">needs it for `script` tags</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Subword Mode</span>
(add-hook 'js-mode-hook #'subword-mode)
(add-hook 'js-jsx-mode-hook #'subword-mode)
(add-hook 'typescript-mode-hook #'subword-mode)
(add-hook 'python-mode-hook #'subword-mode)
(add-hook 'c-mode-hook #'subword-mode)
(add-hook 'clojure-mode-hook #'subword-mode)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable Dash font-locking</span>
(eval-after-load 'dash '(dash-enable-font-lock))
</pre>
</div>
</div>
</li>

<li><a id="org2e3512c"></a>Prettify Symbols<br />
<div class="outline-text-5" id="text-org2e3512c">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-prettify-symbols-mode t)

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my-add-pretty-lambda</span> ()
  <span style="font-style: italic;">"Make some word or string show as pretty Unicode symbols"</span>
  (<span style="font-weight: bold;">push</span> '(<span style="font-style: italic;">"lambda"</span> . 955) prettify-symbols-alist)             <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">&#955;</span>
  (<span style="font-weight: bold;">push</span> '(<span style="font-style: italic;">"-&gt;"</span> . 8594) prettify-symbols-alist)            <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">&#8594;</span>
  (<span style="font-weight: bold;">push</span> '(<span style="font-style: italic;">"=&gt;"</span> . 8658) prettify-symbols-alist)            <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">&#8658;</span>
  (<span style="font-weight: bold;">push</span> '(<span style="font-style: italic;">"map"</span> . 8614) prettify-symbols-alist)               <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">&#8614;</span>
  )

(add-hook 'tex-mode-hook 'my-add-pretty-lambda)

(add-hook 'emacs-lisp-mode-hook
          (<span style="font-weight: bold;">lambda</span> ()
            <span style="font-style: italic;">"Beautify Emacs Symbols"</span>
            (<span style="font-weight: bold;">push</span> '(<span style="font-style: italic;">"&lt;="</span> . <span style="font-style: italic;">"&#8804;"</span>) prettify-symbols-alist)))

(add-hook 'scheme-mode-hook
          (<span style="font-weight: bold;">lambda</span> ()
            <span style="font-style: italic;">"Beautify Emacs Symbols"</span>
            (<span style="font-weight: bold;">push</span> '(<span style="font-style: italic;">"&lt;="</span> . <span style="font-style: italic;">"&#8804;"</span>) prettify-symbols-alist)))

(add-hook 'clojure-mode-hook
          (<span style="font-weight: bold;">lambda</span> ()
            <span style="font-style: italic;">"Beautify Clojure Symbols"</span>
            (<span style="font-weight: bold;">push</span> '(<span style="font-style: italic;">"map"</span> . 8614) prettify-symbols-alist)
            (<span style="font-weight: bold;">push</span> '(<span style="font-style: italic;">"-&gt;"</span> . 8594) prettify-symbols-alist)))
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgdbfa7f3" class="outline-3">
<h3 id="orgdbfa7f3">Packages</h3>
<div class="outline-text-3" id="text-orgdbfa7f3">
</div>
<div id="outline-container-org4633e57" class="outline-4">
<h4 id="org4633e57">Dired</h4>
<div class="outline-text-4" id="text-org4633e57">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> dired-recursive-copies 'always <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">&#8220;always&#8221; means no asking</span>
      dired-recursive-deletes 'top <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">&#8220;top&#8221; means ask once</span>
      dired-dwim-target t)

(add-hook 'dired-mode-hook '(lambda ()
                              (dired-hide-details-mode 1)))

(put 'dired-find-alternate-file 'disabled nil)
</pre>
</div>
</div>
</div>
