content/my-emacs-config.org
*** Vertico / Orderless / CtrlF / Marginalia / Consult
  Better buffer search and improved minibuffer experience
  #+begin_src emacs-lisp
        (vertico-mode)
        (marginalia-mode)

        (setq completion-styles '(orderless basic)
              completion-category-overrides '((file (styles basic partial-completion))))

        (advice-add #'vertico--setup :after
                    (lambda (&rest _)
                      (setq-local completion-auto-help nil
                                  completion-show-inline-help nil)))

        ;; Consult
        (global-set-key (kbd "C-x b") 'consult-buffer)
        (global-set-key (kbd "C-x 4 b") 'consult-buffer-other-window)
        (global-set-key (kbd "M-s G") 'consult-git-grep)
        (global-set-key (kbd "M-g g") 'consult-goto-line)
        (global-set-key (kbd "M-g M-g") 'consult-goto-line)
        (global-set-key (kbd "M-g f") 'consult-flymake)
        (global-set-key (kbd "C-x p b") 'consult-project-buffer)
        (global-set-key (kbd "M-s l") 'consult-line)

        ;; Use Consult to select xref locations with preview
        (setq xref-show-xrefs-function #'consult-xref
              xref-show-definitions-function #'consult-xref)

        ;; Enable vertico-multiform
    (vertico-multiform-mode)

    ;; Configure the display per completion category.
    ;; Use the grid display for files and a buffer
    ;; for the consult-grep commands.
    (setq vertico-multiform-categories
          '(
            ;;(file grid)
            (consult-grep buffer)))
  #+end_src
*** Corfu & Cape
Auto-completion in Emacs.
#+BEGIN_SRC emacs-lisp
  ;; TAB cycle if there are only few candidates
  (setq completion-cycle-threshold 3)
  (setq tab-always-indent 'complete)

  (setq corfu-auto t)
  (global-corfu-mode)

  ;; Cape
  ;; Add `completion-at-point-functions', used by `completion-at-point'.
  (add-to-list 'completion-at-point-functions #'cape-file)
  (add-to-list 'completion-at-point-functions #'cape-dabbrev)
  (add-to-list 'completion-at-point-functions #'cape-keyword)
  (add-to-list 'completion-at-point-functions #'cape-sgml)
  (add-to-list 'completion-at-point-functions #'cape-symbol)
#+END_SRC
*** Web Development
  #+begin_src emacs-lisp
    (setq css-indent-offset 2)

    (add-hook 'js-mode-hook
              (lambda ()
                (define-key js-mode-map (kbd "M-.")
                  'xref-find-definitions)))

    ;; Configure Eglot Eslint/Flymake with JSX and TSX
    ;; wraps `flymake-eslint-enable' to run only root dirs with `.eslintrc' file
    (defun me/flymake-eslint-enable-maybe ()
      "Enable `flymake-eslint' based on the project configuration.
                 Search for the project ESLint configuration to determine whether the buffer
                 should be checked."
      (when-let* ((root (locate-dominating-file (buffer-file-name) "package.json"))
                  (rc (locate-file ".eslintrc" (list root) '(".js" ".json"))))
        (make-local-variable 'exec-path)
        (push (file-name-concat root "node_modules" ".bin") exec-path)
        (flymake-eslint-enable)))


    (add-hook 'eglot-managed-mode-hook (lambda ()
                                         (me/flymake-eslint-enable-maybe)))

    (add-hook 'typescript-mode-hook (lambda ()
                              (setq-local eglot-stay-out-of '(flymake))
                              (eglot-ensure)))
    (add-hook 'js-mode-hook (lambda ()
                              (setq-local eglot-stay-out-of '(flymake))
                              (eglot-ensure)))
    (add-hook 'js-jsx-mode-hook (lambda ()
                                  (setq-local eglot-stay-out-of '(flymake))
                                  (eglot-ensure)))
  #+end_src
*** Rainbow Delimiters
 #+begin_src emacs-lisp
   (custom-set-faces
          '(rainbow-delimiters-depth-1-face ((t (:foreground "blue violet"))))
          '(rainbow-delimiters-depth-2-face ((t (:foreground "red"))))
          '(rainbow-delimiters-depth-3-face ((t (:foreground "cyan3"))))
          '(rainbow-delimiters-depth-4-face ((t (:foreground "blue"))))
          '(rainbow-delimiters-depth-5-face ((t (:foreground "gold"))))
          '(rainbow-delimiters-depth-6-face ((t (:foreground "lavender"))))
          '(rainbow-delimiters-depth-7-face ((t (:foreground "ivory"))))
          '(rainbow-delimiters-depth-8-face ((t (:foreground "magenta"))))
          '(rainbow-delimiters-depth-9-face ((t (:foreground "red")))))

   (add-hook 'clojure-mode-hook #'rainbow-delimiters-mode)
   (add-hook 'emacs-lisp-mode-hook #'rainbow-delimiters-mode)
   (add-hook 'ielm-mode-hook #'rainbow-delimiters-mode)
   (add-hook 'lisp-interaction-mode-hook #'rainbow-delimiters-mode)
   (add-hook 'lisp-mode-hook #'rainbow-delimiters-mode)
 #+end_src
*** Clojure
#+begin_src emacs-lisp
  (setq cider-clojure-cli-aliases "-M:dev"
        cider-eval-result-prefix "=>"
        cider-repl-display-help-banner nil)

  (remove-hook 'flymake-diagnostic-functions #'flymake-proc-legacy-flymake)
  (add-hook 'clojure-mode-hook #'flymake-kondor-setup)
  (add-hook 'clojure-mode-hook (lambda ()
                                 (add-hook 'after-save-hook #'eglot-format-buffer nil 'make-it-local)))
  (add-hook 'clojure-mode-hook 'eglot-ensure)
#+end_src

