my-emacs-config.html
<div id="outline-container-orgea75873" class="outline-4">
<h4 id="orgea75873">Vertico / Orderless / CtrlF / Marginalia / Consult</h4>
<div class="outline-text-4" id="text-orgea75873">
<p>
Better buffer search and improved minibuffer experience
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">    (vertico-mode)
    (marginalia-mode)

    (<span style="font-weight: bold;">setq</span> completion-styles '(orderless basic)
          completion-category-overrides '((file (styles basic partial-completion))))

    (advice-add #'vertico--setup <span style="font-weight: bold;">:after</span>
                (<span style="font-weight: bold;">lambda</span> (<span style="font-weight: bold; text-decoration: underline;">&amp;rest</span> _)
                  (<span style="font-weight: bold;">setq-local</span> completion-auto-help nil
                              completion-show-inline-help nil)))

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Consult</span>
    (global-set-key (kbd <span style="font-style: italic;">"C-x b"</span>) 'consult-buffer)
    (global-set-key (kbd <span style="font-style: italic;">"C-x 4 b"</span>) 'consult-buffer-other-window)
    (global-set-key (kbd <span style="font-style: italic;">"M-s G"</span>) 'consult-git-grep)
    (global-set-key (kbd <span style="font-style: italic;">"M-g g"</span>) 'consult-goto-line)
    (global-set-key (kbd <span style="font-style: italic;">"M-g M-g"</span>) 'consult-goto-line)
    (global-set-key (kbd <span style="font-style: italic;">"M-g f"</span>) 'consult-flymake)
    (global-set-key (kbd <span style="font-style: italic;">"C-x p b"</span>) 'consult-project-buffer)
    (global-set-key (kbd <span style="font-style: italic;">"M-s l"</span>) 'consult-line)

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use Consult to select xref locations with preview</span>
    (<span style="font-weight: bold;">setq</span> xref-show-xrefs-function #'consult-xref
          xref-show-definitions-function #'consult-xref)

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable vertico-multiform</span>
(vertico-multiform-mode)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Configure the display per completion category.</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use the grid display for files and a buffer</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">for the consult-grep commands.</span>
(<span style="font-weight: bold;">setq</span> vertico-multiform-categories
      '(
        <span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">(file grid)</span>
        (consult-grep buffer)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgff70f74" class="outline-4">
<h4 id="orgff70f74">Corfu &amp; Cape</h4>
<div class="outline-text-4" id="text-orgff70f74">
<p>
Auto-completion in Emacs.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">TAB cycle if there are only few candidates</span>
(<span style="font-weight: bold;">setq</span> completion-cycle-threshold 3)
(<span style="font-weight: bold;">setq</span> tab-always-indent 'complete)

(<span style="font-weight: bold;">setq</span> corfu-auto t)
(global-corfu-mode)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Cape</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Add `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">completion-at-point-functions</span><span style="font-weight: bold; font-style: italic;">', used by `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">completion-at-point</span><span style="font-weight: bold; font-style: italic;">'.</span>
(add-to-list 'completion-at-point-functions #'cape-file)
(add-to-list 'completion-at-point-functions #'cape-dabbrev)
(add-to-list 'completion-at-point-functions #'cape-keyword)
(add-to-list 'completion-at-point-functions #'cape-sgml)
(add-to-list 'completion-at-point-functions #'cape-symbol)
</pre>
</div>
</div>
</div>
<div id="outline-container-org8abf25b" class="outline-4">
<h4 id="org8abf25b">Web Development</h4>
<div class="outline-text-4" id="text-org8abf25b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> css-indent-offset 2)

(add-hook 'js-mode-hook
          (<span style="font-weight: bold;">lambda</span> ()
            (define-key js-mode-map (kbd <span style="font-style: italic;">"M-."</span>)
              'xref-find-definitions)))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Configure Eglot Eslint/Flymake with JSX and TSX</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">wraps `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">flymake-eslint-enable</span><span style="font-weight: bold; font-style: italic;">' to run only root dirs with `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">.eslintrc</span><span style="font-weight: bold; font-style: italic;">' file</span>
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">me/flymake-eslint-enable-maybe</span> ()
  <span style="font-style: italic;">"Enable `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">flymake-eslint</span><span style="font-style: italic;">' based on the project configuration.</span>
<span style="font-style: italic;">             Search for the project ESLint configuration to determine whether the buffer</span>
<span style="font-style: italic;">             should be checked."</span>
  (<span style="font-weight: bold;">when-let*</span> ((root (locate-dominating-file (buffer-file-name) <span style="font-style: italic;">"package.json"</span>))
              (rc (locate-file <span style="font-style: italic;">".eslintrc"</span> (list root) '(<span style="font-style: italic;">".js"</span> <span style="font-style: italic;">".json"</span>))))
    (make-local-variable 'exec-path)
    (<span style="font-weight: bold;">push</span> (file-name-concat root <span style="font-style: italic;">"node_modules"</span> <span style="font-style: italic;">".bin"</span>) exec-path)
    (flymake-eslint-enable)))


(add-hook 'eglot-managed-mode-hook (<span style="font-weight: bold;">lambda</span> ()
                                     (me/flymake-eslint-enable-maybe)))

(add-hook 'typescript-mode-hook (<span style="font-weight: bold;">lambda</span> ()
                          (<span style="font-weight: bold;">setq-local</span> eglot-stay-out-of '(flymake))
                          (eglot-ensure)))
(add-hook 'js-mode-hook (<span style="font-weight: bold;">lambda</span> ()
                          (<span style="font-weight: bold;">setq-local</span> eglot-stay-out-of '(flymake))
                          (eglot-ensure)))
(add-hook 'js-jsx-mode-hook (<span style="font-weight: bold;">lambda</span> ()
                              (<span style="font-weight: bold;">setq-local</span> eglot-stay-out-of '(flymake))
                              (eglot-ensure)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcff8e60" class="outline-4">
<h4 id="orgcff8e60">Rainbow Delimiters</h4>
<div class="outline-text-4" id="text-orgcff8e60">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(custom-set-faces
       '(rainbow-delimiters-depth-1-face ((t (<span style="font-weight: bold;">:foreground</span> <span style="font-style: italic;">"blue violet"</span>))))
       '(rainbow-delimiters-depth-2-face ((t (<span style="font-weight: bold;">:foreground</span> <span style="font-style: italic;">"red"</span>))))
       '(rainbow-delimiters-depth-3-face ((t (<span style="font-weight: bold;">:foreground</span> <span style="font-style: italic;">"cyan3"</span>))))
       '(rainbow-delimiters-depth-4-face ((t (<span style="font-weight: bold;">:foreground</span> <span style="font-style: italic;">"blue"</span>))))
       '(rainbow-delimiters-depth-5-face ((t (<span style="font-weight: bold;">:foreground</span> <span style="font-style: italic;">"gold"</span>))))
       '(rainbow-delimiters-depth-6-face ((t (<span style="font-weight: bold;">:foreground</span> <span style="font-style: italic;">"lavender"</span>))))
       '(rainbow-delimiters-depth-7-face ((t (<span style="font-weight: bold;">:foreground</span> <span style="font-style: italic;">"ivory"</span>))))
       '(rainbow-delimiters-depth-8-face ((t (<span style="font-weight: bold;">:foreground</span> <span style="font-style: italic;">"magenta"</span>))))
       '(rainbow-delimiters-depth-9-face ((t (<span style="font-weight: bold;">:foreground</span> <span style="font-style: italic;">"red"</span>)))))

(add-hook 'clojure-mode-hook #'rainbow-delimiters-mode)
(add-hook 'emacs-lisp-mode-hook #'rainbow-delimiters-mode)
(add-hook 'ielm-mode-hook #'rainbow-delimiters-mode)
(add-hook 'lisp-interaction-mode-hook #'rainbow-delimiters-mode)
(add-hook 'lisp-mode-hook #'rainbow-delimiters-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-org4a70314" class="outline-4">
<h4 id="org4a70314">Clojure</h4>
<div class="outline-text-4" id="text-org4a70314">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> cider-clojure-cli-aliases <span style="font-style: italic;">"-M:dev"</span>
      cider-eval-result-prefix <span style="font-style: italic;">"=&gt;"</span>
      cider-repl-display-help-banner nil)

(remove-hook 'flymake-diagnostic-functions #'flymake-proc-legacy-flymake)
(add-hook 'clojure-mode-hook #'flymake-kondor-setup)
(add-hook 'clojure-mode-hook (<span style="font-weight: bold;">lambda</span> ()
                               (add-hook 'after-save-hook #'eglot-format-buffer nil 'make-it-local)))
(add-hook 'clojure-mode-hook 'eglot-ensure)
</pre>
</div>
</div>
</div>
