my-emacs-config.html

<div id="outline-container-org53ec7ff" class="outline-4">
<h4 id="org53ec7ff">Dev tools</h4>
<div class="outline-text-4" id="text-org53ec7ff">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Tree-sitter</span>

 <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">activate tree-sitter on any buffer containing code for which it has a parser available</span>
  (global-tree-sitter-mode)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">you can easily see the difference tree-sitter-hl-mode makes for python, ts or tsx</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">by switching on and off</span>
  (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode)

 <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">we choose this instead of tsx-mode so that eglot can automatically figure out language for server</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">see https://github.com/joaotavora/eglot/issues/624 and https://github.com/joaotavora/eglot#handling-quirky-servers</span>
  (<span style="font-weight: bold;">define-derived-mode</span> <span style="font-weight: bold;">typescriptreact-mode</span> typescript-mode
    <span style="font-style: italic;">"TypeScript TSX"</span>)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">use our derived mode for tsx files</span>
  (add-to-list 'auto-mode-alist '(<span style="font-style: italic;">"\\.tsx?\\'"</span> . typescriptreact-mode))
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">by default, typescript-mode is mapped to the treesitter typescript parser</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">use our derived mode to map both .tsx AND .ts -&gt; typescriptreact-mode -&gt; treesitter tsx</span>
  (add-to-list 'tree-sitter-major-mode-language-alist '(typescriptreact-mode . tsx))
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
